read_verilog paralsub.v
prep -top paralsub
show -format svg -prefix paralsub_map paralsub
